l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_modem.h
#define MDM_PE_DIGGAINOFF_RST    0x0

__INLINE uint8_t mdm_pe_diggainoff_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_POW_DIGGAINOFF_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000000F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_pe_diggainoff_setf(uint8_t pediggainoff)
{
    ASSERT_ERR((((uint32_t)pediggainoff << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(MDM_POW_DIGGAINOFF_ADDR, (uint32_t)pediggainoff << 0);
}

/**
 * @brief FOE_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  25:16             FOE_REAL   0x0
 *  09:00             FOE_IMAG   0x0
 * </pre>
 */
#define MDM_FOE_STATUS_ADDR   0x000000B8
#define MDM_FOE_STATUS_OFFSET 0x000000B8
#define MDM_FOE_STATUS_INDEX  0x0000002E
#define MDM_FOE_STATUS_RESET  0x00000000

__INLINE uint32_t mdm_foe_status_get(void)
{
    return REG_RPL_RD(MDM_FOE_STATUS_ADDR);
}

__INLINE void mdm_foe_status_set(uint32_t value)
{
    REG_RPL_WR(MDM_FOE_STATUS_ADDR, value);
}

// field definitions
#define MDM_FOE_REAL_MASK   ((uint32_t)0x03FF0000)
#define MDM_FOE_REAL_LSB    16
#define MDM_FOE_REAL_WIDTH  ((uint32_t)0x0000000A)
#define MDM_FOE_IMAG_MASK   ((uint32_t)0x000003FF)
#define MDM_FOE_IMAG_LSB    0
#define MDM_FOE_IMAG_WIDTH  ((uint32_t)0x0000000A)

#define MDM_FOE_REAL_RST    0x0
#define MDM_FOE_IMAG_RST    0x0

__INLINE void mdm_foe_status_unpack(uint16_t* foereal, uint16_t* foeimag)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);

    *foereal = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *foeimag = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t mdm_foe_real_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE uint16_t mdm_foe_imag_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_FOE_STATUS_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief TECOC_STATUS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00             TE_INDEX   0x0
 * </pre>
 */
#define MDM_TECOC_STATUS_ADDR   0x000000B9
#define MDM_TECOC_STATUS_OFFSET 0x000000B9
#define MDM_TECOC_STATUS_INDEX  0x0000002E
#define MDM_TECOC_STATUS_RESET  0x00000000

__INLINE uint32_t mdm_tecoc_status_get(void)
{
    return REG_RPL_RD(MDM_TECOC_STATUS_ADDR);
}

__INLINE void mdm_tecoc_status_set(uint32_t value)
{
    REG_RPL_WR(MDM_TECOC_STATUS_ADDR, value);
}

// field definitions
#define MDM_TE_INDEX_MASK   ((uint32_t)0x00000007)
#define MDM_TE_INDEX_LSB    0
#define MDM_TE_INDEX_WIDTH  ((uint32_t)0x00000003)

#define MDM_TE_INDEX_RST    0x0

__INLINE uint8_t mdm_te_index_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_TECOC_STATUS_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
    return (localVal >> 0);
}

/**
 * @brief GSG_DEN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00              GSG_DEN   0x0
 * </pre>
 */
#define MDM_GSG_DEN_ADDR   0x000000C0
#define MDM_GSG_DEN_OFFSET 0x000000C0
#define MDM_GSG_DEN_INDEX  0x00000030
#define MDM_GSG_DEN_RESET  0x00000000

__INLINE uint32_t mdm_gsg_den_get(void)
{
    return REG_RPL_RD(MDM_GSG_DEN_ADDR);
}

__INLINE void mdm_gsg_den_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_DEN_ADDR, value);
}

// field definitions
#define MDM_GSG_DEN_MASK   ((uint32_t)0x00000007)
#define MDM_GSG_DEN_LSB    0
#define MDM_GSG_DEN_WIDTH  ((uint32_t)0x00000003)

#define MDM_GSG_DEN_RST    0x0

__INLINE uint8_t mdm_gsg_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_DEN_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_den_setf(uint8_t gsgden)
{
    ASSERT_ERR((((uint32_t)gsgden << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(MDM_GSG_DEN_ADDR, (uint32_t)gsgden << 0);
}

/**
 * @brief GSG_LSTVAL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  05:00           GSG_LSTVAL   0x14
 * </pre>
 */
#define MDM_GSG_LSTVAL_ADDR   0x000000C1
#define MDM_GSG_LSTVAL_OFFSET 0x000000C1
#define MDM_GSG_LSTVAL_INDEX  0x00000030
#define MDM_GSG_LSTVAL_RESET  0x00000014

__INLINE uint32_t mdm_gsg_lstval_get(void)
{
    return REG_RPL_RD(MDM_GSG_LSTVAL_ADDR);
}

__INLINE void mdm_gsg_lstval_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_LSTVAL_ADDR, value);
}

// field definitions
#define MDM_GSG_LSTVAL_MASK   ((uint32_t)0x0000003F)
#define MDM_GSG_LSTVAL_LSB    0
#define MDM_GSG_LSTVAL_WIDTH  ((uint32_t)0x00000006)

#define MDM_GSG_LSTVAL_RST    0x14

__INLINE uint8_t mdm_gsg_lstval_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_LSTVAL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000003F)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_lstval_setf(uint8_t gsglstval)
{
    ASSERT_ERR((((uint32_t)gsglstval << 0) & ~((uint32_t)0x0000003F)) == 0);
    REG_RPL_WR(MDM_GSG_LSTVAL_ADDR, (uint32_t)gsglstval << 0);
}

/**
 * @brief GSG_NOM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  07:00              GSG_NOM   0x1
 * </pre>
 */
#define MDM_GSG_NOM_ADDR   0x000000C2
#define MDM_GSG_NOM_OFFSET 0x000000C2
#define MDM_GSG_NOM_INDEX  0x00000030
#define MDM_GSG_NOM_RESET  0x00000001

__INLINE uint32_t mdm_gsg_nom_get(void)
{
    return REG_RPL_RD(MDM_GSG_NOM_ADDR);
}

__INLINE void mdm_gsg_nom_set(uint32_t value)
{
    REG_RPL_WR(MDM_GSG_NOM_ADDR, value);
}

// field definitions
#define MDM_GSG_NOM_MASK   ((uint32_t)0x000000FF)
#define MDM_GSG_NOM_LSB    0
#define MDM_GSG_NOM_WIDTH  ((uint32_t)0x00000008)

#define MDM_GSG_NOM_RST    0x1

__INLINE uint8_t mdm_gsg_nom_getf(void)
{
    uint32_t localVal = REG_RPL_RD(MDM_GSG_NOM_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x000000FF)) == 0);
    return (localVal >> 0);
}

__INLINE void mdm_gsg_nom_setf(uint8_t gsgnom)
{
    ASSERT_ERR((((uint32_t)gsgnom << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(MDM_GSG_NOM_ADDR, (uint32_t)gsgnom << 0);
}

/**
 * @brief GSG_THREPS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  04:00           GSG_THREPS   0x7
 * </pre>
 */
#define MDM_GSG_THREPS_ADDR   0x000000C3
#define MDM_GSG_THREPS_OFFSET 0x000000C3
#define MDM_GSG_THREPS_INDEX  0x00000030
#define MDM_GSG_THREPS_RESET  0x00000007

__INLINE uint32_t mdm_gsg_threps_get(void)
{
    return REG_RPL_RD(MDM_GSG_THREPS_ADDR);
}

